In [1]:
import pandas as pd
import numpy as np

In [2]:
# buat array
data = np.array([
    [1,4],
    [2,5],
    [3,6]
])
data

array([[1, 4],
       [2, 5],
       [3, 6]])

In [3]:
df = pd.DataFrame(
    data,
    index=['baris1','baris2','baris3'],
    columns=['kolom1','kolom2']
)
df

        kolom1  kolom2
baris1       1       4
baris2       2       5
baris3       3       6

In [4]:
# contoh membuat DataFrame sendiri
# pembuatan data /  data harus seimbang : 
provinsi = ['Kalimantan Selatan','Jawa Barat','Nusa Tenggara Timur']
jumlah_penduduk = [39613493, 29730311, 21944577]

# dictionary / dict
dict = {'Provinsi' : provinsi,
        'jumlah_penduduk' : jumlah_penduduk
}
# konversi ke DataFrame
df_jumlah_penduduk = pd.DataFrame(dict)
df_jumlah_penduduk

              Provinsi  jumlah_penduduk
0   Kalimantan Selatan         39613493
1           Jawa Barat         29730311
2  Nusa Tenggara Timur         21944577

In [5]:
df_ujian = pd.read_csv('StudentsPerformance.csv')
# menampilkan 1000 baris 8 kolom
df_ujian.shape

(1000, 8)

In [6]:
df_ujian.index

RangeIndex(start=0, stop=1000, step=1)

In [7]:
df_ujian.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [8]:
df_ujian.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [9]:
# Menampilkan data sebanyak 5 baris :
df_ujian.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [10]:
# menampilkan info tipe data
df_ujian.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [11]:
# menjelaskan statistik dari data
df_ujian.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [12]:
len(df_ujian) # panjang data
max(df_ujian.index) # maksimal data
min(df_ujian.index) # minimal data
type (df_ujian) # menyajikan tipe data
round(df_ujian, 2) # ini untuk membulatkan

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [13]:
df_ujian['writing score'] # memilih kolom
type(df_ujian['writing score']) # mengetahui tipe data
# df_ujian # menampikan semua kolom 
df_ujian[['gender','writing score']]  # MENAMPILKAN SEBAGIAN KOLOM

     gender  writing score
0    female             74
1    female             88
2    female             93
3      male             44
4      male             75
..      ...            ...
995  female             95
996    male             55
997  female             65
998  female             77
999  female             86

[1000 rows x 2 columns]

In [14]:
df_ujian['language score'] = 70
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70
996,male,group C,high school,free/reduced,none,62,55,55,70
997,female,group C,high school,free/reduced,completed,59,71,65,70
998,female,group D,some college,standard,completed,68,78,77,70
999,female,group D,some college,free/reduced,none,77,86,86,70

In [15]:
# membuat angka 0-1000
language_score = np.arange(0, 1000) # mulai dan jumlah
df_ujian['language score'] = language_score
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,0
1,female,group C,some college,standard,completed,69,90,88,1
2,female,group B,master's degree,standard,none,90,95,93,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,3
4,male,group C,some college,standard,none,76,78,75,4
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,995
996,male,group C,high school,free/reduced,none,62,55,55,996
997,female,group C,high school,free/reduced,completed,59,71,65,997
998,female,group D,some college,standard,completed,68,78,77,998
999,female,group D,some college,free/reduced,none,77,86,86,999

In [16]:
# membuat nilai acak dari 60 - 100, sebanyak 1000
int_language_score = np.random.randint(60,100, size=1000)
df_ujian['language score'] = int_language_score
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,95
1,female,group C,some college,standard,completed,69,90,88,73
2,female,group B,master's degree,standard,none,90,95,93,77
3,male,group A,associate's degree,free/reduced,none,47,57,44,75
4,male,group C,some college,standard,none,76,78,75,89
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,63
996,male,group C,high school,free/reduced,none,62,55,55,63
997,female,group C,high school,free/reduced,completed,59,71,65,62
998,female,group D,some college,standard,completed,68,78,77,75
999,female,group D,some college,free/reduced,none,77,86,86,84

In [17]:
# membuat nilai acak dari 1 - 100 secara acak
np.random.uniform(1,100,size=1000)

array([49.40956776, 66.78442727, 16.1397135 , 47.31055724,  8.3662677 ,
       49.33802371, 32.01253206, 25.7873925 , 22.32410124, 62.88627152,
       70.79565314, 38.06377519, 73.08680928, 71.90647523, 71.43687138,
       41.84154336, 56.88767145, 53.68049438, 99.69946896, 10.38738633,
       68.59142518, 75.82988131, 56.21836682, 60.28284448, 78.5658395 ,
       41.22250455, 88.9865344 , 23.74582559, 39.6385461 , 11.42173699,
       67.18418132, 66.21290309, 30.12854849, 72.35582763, 72.11344252,
       92.56561817, 95.95039976, 64.86649729,  3.82721117, 25.01721393,
       95.96291675, 43.99227364, 90.14484828, 69.27916353, 16.81502537,
       54.79353058, 19.27082963, 97.12138451, 99.5678538 ,  9.78770536,
       22.63704038, 70.8101322 , 94.13848575, 46.82012068, 31.67943883,
       22.73034973, 90.15265568, 63.10408323, 61.6381888 , 68.41585062,
       19.25049478, 53.66208347, 28.41183837, 31.70946317, 84.1799042 ,
       57.596645  , 99.72475467, 84.20191495,  2.55929791, 68.22594407,
       14.0226607 ,  6.54317694, 23.50453726, 52.10519615, 36.34761101,
       61.84153976,  6.3243973 , 93.96002197, 25.99685849, 22.25284339,
       36.9299928 , 57.18978548,  1.42228365, 65.53712982,  7.79359815,
       79.16450716, 56.70471106, 60.52748146, 82.134753  ,  9.43463129,
       64.8064974 , 61.12084349, 10.1245888 , 33.6477448 , 13.11975454,
       75.29353053, 78.34464776, 81.62013445, 42.65312831, 97.46279026,
       59.29882016, 34.43305366, 15.05936326, 20.82455754, 37.221712  ,
       74.32389716,  5.49717317, 58.19600804, 79.25799716, 80.08205668,
       23.81779847, 34.91248585,  8.45217073, 60.56102004, 39.41509149,
       47.18822849, 50.07049877, 51.25994146,  1.18782826, 14.27900502,
       88.92214356, 29.92745167, 70.06065637,  3.12546139, 43.4682465 ,
       61.53136852, 36.1840183 ,  1.2861542 , 42.26749247,  3.19885206,
       38.41827548, 67.17060081, 10.97661002, 61.86068402, 69.84432484,
       39.71045545, 77.29767279, 92.17995798, 69.22125816, 72.69962969,
       25.10007366, 30.89836519, 83.36252398, 13.3792597 , 49.15596575,
       59.02390247, 58.08527213,  5.29421638, 54.58319554, 20.04690286,
       98.33810641, 66.84808696, 21.73793965, 64.50307249, 38.07182092,
        9.55370108, 54.94123781, 31.04490974, 22.24493675, 65.68759407,
       72.93963044, 48.42566679, 20.96031156, 98.28969084, 28.63406356,
       83.0104069 , 72.01126715, 44.01303538, 43.57729484,  5.56675568,
       12.47104183, 75.4112762 , 48.70795269, 71.83930758, 59.41954508,
       32.50798143, 78.04625791, 28.29226214, 74.46326382, 77.79771881,
       71.88510713, 93.02640155, 65.2959263 ,  8.17492475, 43.3577138 ,
       12.13740294, 24.97854972, 72.6267272 , 44.73343741, 26.67584955,
       15.52949633, 45.47036278, 98.28691606, 98.1635898 ,  2.25597433,
       37.46884083, 22.95260837, 98.88209457, 71.95452594, 24.00011608,
       69.6822367 , 72.59473472, 42.38314132, 73.68783412, 52.49912458,
       94.64310541, 43.39960526, 42.08744842, 79.97517358, 94.33344097,
       61.6989344 , 38.82382807,  2.62506568, 64.0728191 , 73.91327777,
       17.7016247 , 75.5630533 , 20.13147349, 64.26267694, 62.30117874,
       24.36467993, 65.83519386, 57.74222274,  3.02546829, 23.49080742,
       90.82474964, 88.26248148, 56.5333999 ,  5.4184034 , 51.43385403,
       85.07738795, 50.27735442,  2.40842678,  1.20637962, 30.55668732,
        6.92855545, 70.94962106, 37.31184887, 26.34217825, 87.79775234,
       51.37037457, 62.33153395, 80.04904816, 69.86669111, 88.8018599 ,
        9.23796734, 88.2449649 , 79.53755061, 70.10198929, 31.1793186 ,
       83.04503215, 76.89037193, 95.27979592, 76.91683785, 17.91019166,
       11.13470784, 28.89168341, 37.417279  , 15.6866539 , 65.12760286,
       49.61642179, 48.76459677, 13.88697925, 13.16959758, 60.63139244,
       47.09105664, 25.18350688, 37.09546417,  1.96842232, 59.91789359,
       42.27414388, 45.57561441, 78.72198042, 40.72944822, 70.03302762,
       39.19038281, 67.80594841, 70.82735706, 82.88583962, 53.25199128,
       19.94950699, 23.7267501 , 14.3049456 , 94.08057672,  2.02527774,
       32.2157662 , 85.73762866, 64.68206018, 17.90881744, 98.32174077,
       20.23512639, 84.18385045, 80.68902505, 16.38475796, 88.83050634,
       17.04218061, 53.22528162, 13.16085992, 31.31267824, 97.31071478,
       31.5226338 , 52.59314246, 70.60335734, 88.75080665, 53.94934475,
       93.78147778, 62.78714827, 98.62060146, 74.37228498, 13.19298717,
       62.24539618,  3.26738185, 32.40772398, 98.83438068, 96.01619082,
       95.40136675, 70.51189383, 51.00492861, 49.49100452, 76.64531876,
       28.9963471 , 35.21336476, 85.38567743, 43.68930201, 96.95907357,
       56.44567663,  8.38138212, 23.6129702 , 98.03877347, 31.18671973,
       48.2455462 , 26.88111729, 70.6805074 , 96.06615277, 22.02455193,
       95.65348023, 58.674648  , 43.40913596,  9.73866982, 67.59085984,
       79.35313279, 87.35911805, 37.84622319, 35.32958317, 96.83544259,
       75.25284237, 56.40811904, 16.98182311, 50.1271671 , 84.49256178,
       92.66330279, 47.74171061, 60.79131652, 75.27349309, 17.76382774,
       33.11751078, 90.57482173, 10.75688244, 88.02792342, 63.60706814,
       71.79949671,  6.85627827, 40.94719845, 53.03696783,  4.63685892,
       80.44105899, 59.19632103, 41.10806127,  6.87050337, 38.28796378,
       59.37525077, 99.22414187, 36.70343395, 17.92454989,  6.03631906,
       42.21549702, 90.52318533, 31.86671142,  3.43920165, 83.7633119 ,
       49.69753619, 14.01651903, 63.2924844 , 51.85261799, 28.75923359,
       48.51200364, 68.82811606, 60.64777934, 76.44147012, 56.32753824,
       75.43695109, 10.68794083, 99.01328271, 61.45595265, 30.9598391 ,
       31.61451708, 51.54180751, 72.41230855, 52.88595567, 96.38788126,
       91.32299632, 12.59276574, 95.97985359, 44.85612928, 88.66015942,
       65.75588081, 43.78241394, 31.46402844, 53.09635862, 53.28181553,
       37.39616558, 34.80468015, 59.95611957, 11.89268437, 22.53867726,
       52.14666066, 97.93901521, 46.48285107, 57.94000906,  1.94807867,
       53.33438673, 92.64890863, 24.98097596, 56.45421164, 48.02895151,
       17.82456574, 81.27068292, 23.03250569, 94.20984014, 24.53695095,
       10.779855  , 21.39083929, 72.61709123,  2.47359062, 15.85401465,
       39.45688598, 17.38834952, 78.41207778, 39.8420273 ,  8.50436289,
       26.33670026, 83.81391518, 93.60616239, 81.44266882, 13.52260273,
       43.50738511, 67.10949989,  2.31490135, 93.11878359, 61.42230905,
       37.14087043, 21.12394468,  3.36853187, 49.6396797 , 42.51537314,
       70.38703996, 13.06488987, 24.00544418,  2.4620125 , 66.77148972,
       70.52558934,  4.46530022, 73.49506418, 85.26802806, 13.91521623,
       53.9156058 , 39.33513909, 84.0907498 , 35.58859077, 42.96566169,
       45.59880658, 38.83443476, 65.22960364, 30.44072566, 25.1165085 ,
       73.42230859, 19.32785674, 66.83477927, 58.03829847, 15.37029286,
       57.67323412, 50.10478803, 99.35622904, 61.69863428, 42.72677815,
       46.00117803, 97.21208115, 24.40765784, 59.24681963, 95.72575038,
       83.28571378, 89.92439785, 73.82356366, 78.99705663, 73.93008113,
       58.97206661, 34.90452445, 60.78525372, 28.11035718, 48.149334  ,
       30.97779375, 54.87571382, 85.05455911, 32.87819523, 97.99024319,
        9.30947113, 80.08017406, 95.57283025,  8.11237314, 67.84602071,
       56.52010035, 25.43557632, 52.87860439, 51.38448496, 90.54746726,
       27.72096933, 84.94697127, 75.69021217, 99.52561259, 33.73609298,
       53.48760094, 88.30922226,  3.65184727, 40.2903609 , 73.57259069,
       84.20789326, 57.67609118, 46.02919253, 52.61955783, 23.80498137,
       59.22367464, 84.93268781, 27.61923525, 67.49360942, 35.70659887,
       33.41193249,  7.58196217, 85.81809415, 73.54440393, 72.3305413 ,
        6.37740871,  6.77057034, 41.56010796, 10.45222916,  3.49829822,
       98.69744019, 72.30820063, 14.88066744, 29.30196836, 57.78674985,
       72.90052273, 66.88704721, 72.21305925, 97.72744378, 83.93244122,
       40.58198092, 63.55233292, 55.71712269, 93.0198469 , 63.83139327,
        9.89815622, 99.53287524, 42.99547057, 74.72440327, 55.76048984,
       71.75068458, 45.07021735, 38.50418326, 12.63589558, 20.79234673,
        7.08277965, 42.66743012, 74.41258974, 78.69645899, 59.98092473,
       38.88507104, 99.43858007, 31.29120616, 90.29905999, 18.44731781,
       40.14234819, 44.07562453, 71.08597441, 96.29041037, 94.15678334,
        5.65691025, 74.04124669, 32.07353978, 45.52057772, 89.32847199,
       30.15752579, 89.05993557, 38.93161914, 39.33817979, 20.24054397,
       97.65972714, 80.2378549 , 81.79761173, 22.89566402, 77.04571856,
       54.25144672,  8.38006033, 80.16339135, 96.69831035,  6.02871572,
       29.04117012, 41.42884433,  3.11139373, 24.44409249, 37.5873167 ,
       59.70493693,  6.45365512, 97.77152021, 71.94805415, 47.56071403,
       65.45179454, 58.71764085, 72.49846687, 95.73284837, 97.16376308,
       17.93422035, 85.76420303, 82.89504811, 32.58270714, 72.07714815,
       28.78344562,  6.86281461, 52.67444449,  1.56500691, 51.55417333,
       74.80362392, 46.42880856, 17.28695945, 75.1887211 , 60.76866612,
       38.32869166, 72.7177251 , 70.74653268, 30.39782601, 39.30708142,
       72.32109545, 58.53023448, 49.46630754, 93.18050099, 16.53786811,
       48.86439788, 93.43709709,  8.95370231, 70.46310638, 16.80585142,
       11.18118327, 47.66273628, 85.01547395, 92.31618118, 20.17493557,
       10.35491231, 73.17294982, 84.61787897, 62.93511769, 83.64532999,
       29.03973247, 54.73806988, 96.202984  , 10.89789851,  7.58988936,
       89.94761891, 25.27512641, 22.65574401,  5.445805  , 59.42373063,
       36.34982212, 22.4515943 , 66.74618352, 35.01655677, 39.08879694,
       77.45991816, 69.43144833, 71.43643288, 66.02291441, 79.30316136,
       47.36435888, 97.29024854, 48.58647056, 63.6348954 , 73.74509101,
       14.69769863, 53.22121731, 68.89792908, 39.52733227, 56.40824765,
       28.99054833, 99.3152236 ,  6.94955521, 27.42186358, 82.19577392,
       15.20336366, 58.45866223, 10.58681323,  1.32369602, 58.66201063,
       57.95556387, 75.84944575,  3.52882251, 12.57514576,  1.48457474,
       31.22854963, 27.3827295 ,  2.31153331, 58.06344701, 29.5634029 ,
       35.35654434, 36.67817694, 41.43156922, 86.46427614, 51.15699895,
       58.16324433, 48.63392927, 25.63603905, 33.71321276, 88.27990696,
        2.02154332, 30.12310678, 80.72427091, 64.20247751, 13.0804796 ,
       79.98409592, 28.18955524,  4.1042469 , 84.27331572, 25.4026058 ,
       82.4083987 , 28.29295219, 86.08149271, 59.8429644 , 39.9783648 ,
       92.05683342, 92.59256998, 43.20947137, 21.41221049,  5.22189626,
       71.24965259, 89.37700213, 60.49354947, 73.17981575, 84.20406166,
       53.08396258, 48.83748863, 90.58751776, 74.27014826, 15.53403707,
       56.3224366 , 67.31336529, 12.0621771 , 29.49295622, 26.78156089,
       89.45564676, 13.11215904, 57.58374626, 86.79801133, 54.72551228,
       27.4219795 , 51.99173033,  4.36637709, 84.51985343, 49.12983592,
       16.24786799, 10.58223965, 25.9640641 , 19.8857273 , 71.81758118,
       71.00126553, 70.44263227, 84.30474718, 78.67672359, 69.86860129,
       71.44546789, 28.458472  , 73.48074331, 52.88924617, 73.81459651,
       54.02705435, 46.58759923, 48.74435555,  1.18868689,  9.01027538,
       47.20641453, 51.92519405, 64.42580769, 74.97258032, 66.52015844,
       35.41575268, 38.98442623, 26.79299622, 18.31309082, 13.50863493,
       77.79713696,  7.14549613, 93.51024337, 99.12454139, 38.61679851,
       84.52122067, 86.36057829, 55.7424461 , 47.13175127, 46.43809166,
       23.09203424, 64.19506724,  1.06839539, 46.17359351, 21.22270046,
       38.74693949, 95.00378922, 36.16668621, 69.67783076, 95.56053971,
       33.14638432, 91.99855158, 64.27551969, 10.57911672, 22.97263912,
       37.50474386, 83.73799409, 84.36689349, 98.4441961 , 96.4650079 ,
       90.31314849, 65.1825813 , 29.32542059,  9.99963517, 31.75073368,
       38.06938736, 49.31434467, 43.82056798, 36.58915982, 56.15448522,
       31.11569417, 77.31694073, 11.6483767 , 36.39336564,  8.65191131,
       36.42244024, 69.06639026, 30.85997399,  5.87537261, 60.89001136,
       37.02693654, 61.81580759, 56.5185461 , 86.39038815, 80.44500599,
       84.67372744,  4.70700254, 59.23137569, 52.75552524,  8.26219863,
       74.78239207, 58.76556096, 26.1871027 , 88.14190593, 94.41729859,
       78.42382973, 80.05397375, 21.86891617, 64.63360269, 81.72007847,
       47.65472921, 60.52315858, 13.67063551, 80.31489626, 28.49129183,
        7.34095892, 96.72757416, 37.55000266, 88.0448397 , 33.99987874,
       28.60211078, 90.24978258, 99.13104554,  4.24997224, 55.19528474,
       98.08500156, 23.8079312 , 19.94487046, 69.07779189, 10.02630105,
       26.66512629, 29.91347284, 59.90087603, 36.05240295, 26.11953736,
       92.78274914, 28.08504181, 12.04939303, 21.76176294,  4.47842631,
       75.70806175, 10.45490766,  8.73975499, 93.46867149,  5.96999536,
       31.73741834, 62.53751713, 85.83878156, 93.96791999, 77.90772679,
       74.21292345, 13.00709356, 70.28573466,  6.39070601, 49.41003492,
       86.98996847, 17.48940062, 22.59072113, 73.62299317,  7.2055198 ,
       74.80217115, 11.95998351,  9.28459331, 26.21666611, 11.25930839,
       93.99092556, 97.55425692, 61.27073729, 12.66814651, 55.92706779,
       77.3980218 ,  5.29314869, 81.84191196, 45.25803966, 67.03074006,
       34.84574335, 35.61722721, 76.39390243, 27.62177328, 84.5783128 ,
       91.8624574 , 23.34875148, 53.69048678, 99.17214541, 50.43798232,
        3.91624433, 91.62165081, 55.6376731 , 40.00187267, 59.73783991,
       57.49976185, 39.04375329, 46.18804267, 86.23779965, 17.49707061,
        4.93425355, 58.8062394 ,  7.28551661,  9.68200236, 44.18754894,
       65.26411573, 10.26305275, 28.15554413, 41.4980072 , 44.45166527,
       21.60829145, 67.70622074, 88.290791  , 92.83539275, 61.67416523,
       38.14597823, 23.35545059, 42.23568958, 23.13485556, 33.5986825 ,
       86.31218928, 63.40294579, 54.73395861, 99.39046597, 46.75458887,
       74.1321065 , 33.91348254, 17.51962329,  1.43950596,  6.72073915,
       11.54632592, 79.66383524, 80.74551466, 24.64449478, 71.27580656,
       23.5288707 ,  3.02622046, 16.86966009,  6.13848857, 79.10420084,
       70.33909118, 75.8863993 ,  9.34749907, 43.34782932, 71.62423061,
       56.85812674, 75.14836039, 76.61536179, 35.97437701, 58.18474189])

In [19]:
score1 = np.random.uniform(1,100, size=1000)
score2 = np.random.uniform(1,100, size=1000)
score1

array([ 4.51859775, 75.22663272, 23.58204982, 17.22856009, 94.46382543,
       69.529526  , 94.2633412 , 74.88200279, 92.02031438, 45.88955924,
       89.74620412, 14.38533049, 79.04500112, 62.11809617, 65.30587265,
       35.39480096, 12.02963018, 70.22060101, 21.96260772,  4.51786279,
       28.21034546, 45.55049668, 53.24574577, 40.18047217, 42.43859677,
       57.21168368, 55.04833747, 85.15611916, 39.61355094, 88.42838666,
       12.36824193, 64.00919656, 70.05019129, 45.28041422, 18.97110474,
       74.16057434, 54.18990748, 64.40845151, 82.95495369, 53.88905522,
       51.23096482, 45.38777752, 33.77433772, 59.06079972, 76.37911884,
       10.86031176, 99.20924009,  5.4916048 , 61.52381376, 65.09737732,
       45.20166006,  3.22757006, 30.38140192, 73.13924981, 81.04717373,
       39.95547005, 55.43041092,  8.14266759, 50.36365022,  7.02802985,
       65.33122073, 20.09678286, 14.16086045, 74.55921446, 41.12334352,
        8.7554911 , 51.59549988, 40.75023159, 96.55057775, 60.55495196,
       11.74448975, 80.53781649, 55.64135521, 62.09012073, 40.5410951 ,
       81.68912004, 60.65270045, 90.53684541, 93.18505434, 70.42288698,
       75.44672003,  9.79392888, 41.41128822, 30.23572282, 53.74630442,
       95.71685023, 34.0661067 ,  2.00423536, 84.57122419, 59.45751325,
       77.7109339 , 92.72794854, 75.45286164, 67.39978041, 26.26454235,
       20.31407541, 46.74722885, 93.22459885, 35.95891209, 80.60000966,
       36.47026843, 68.12873434, 12.12924162, 61.80215113, 77.18213061,
       83.12292731, 43.541405  , 93.27151196, 58.85019797, 72.42844507,
       57.70564   , 39.67859554, 68.40738475, 99.85334369, 18.88592697,
       41.02996922, 82.69383598, 17.80199385, 15.15816099, 17.57289634,
       88.94204464, 93.00764398,  5.26344158, 13.97391058, 77.16625872,
       77.34744755, 47.89285911, 17.29900769, 26.72981978, 55.45636498,
       81.30631652, 29.51669282,  5.763904  , 89.12094539, 19.1964498 ,
       50.13486716, 28.79901244, 29.31265328, 72.91614972,  2.08369788,
       87.98488801, 56.35949848, 99.07775945, 13.29570122, 24.47914038,
       26.71778472, 70.26913675, 18.16383614, 85.5738683 , 74.90761305,
       89.76155706, 77.39217602, 33.85398254, 69.43494516, 98.99704394,
       78.50630369, 68.5519697 , 37.10988449, 15.62464507, 96.79100875,
       65.90713313, 35.48214882, 38.10588084, 13.25646645, 29.11945893,
       74.13454015, 27.2917318 , 87.75461038, 18.61989913, 55.56031825,
       92.16549808, 31.48016221, 55.16039164, 89.19429524, 72.38653879,
       46.42459549, 31.05752953, 90.16328026, 59.68911184, 33.45380278,
       86.30162717, 37.92446782, 41.56677042, 99.96791066, 72.90530822,
       70.90625825, 94.75002281, 25.48642461, 73.45175105, 59.25677565,
       98.90879831, 32.03597596, 54.02137852, 27.81797106, 94.28218386,
       24.15553617, 60.16069627, 76.41623629, 60.95503623, 16.00734033,
       47.26533954, 59.30910488, 39.50506633, 98.83060955, 17.70422462,
       89.60841904, 88.35112985,  3.29373043, 69.06691617, 16.68978243,
       68.09029705, 33.74799124, 43.37044462, 44.15887717, 90.34575624,
       86.63013555,  7.49812263, 55.86215338, 50.41009511,  9.91109804,
       90.24452783, 11.15233036,  8.22209989, 50.67861659, 22.12851427,
       96.57631567, 54.63827032, 77.76948634,  8.41853736, 85.80804226,
        9.36510878, 58.03204083, 16.90590718, 59.28827095, 82.63308994,
       83.61627937, 49.48295034, 91.75064748, 19.68359424, 43.51998187,
       58.42644285, 35.95659092,  8.28656731, 68.69848289, 40.05681337,
       41.59267453,  4.52058252, 99.61028912, 64.43491801, 25.24208768,
        8.65178513, 53.41718172, 65.99951476, 66.7492578 , 64.64693134,
       87.4671185 , 65.38312012, 29.99467408, 36.60908076, 96.89852924,
       72.32341923, 39.68277663, 53.15578515, 86.71628206, 28.46120501,
       43.5376091 , 17.27258676, 56.19500024, 15.01061531, 94.0618598 ,
       75.32434987, 71.56765957,  5.10521829, 69.28434741, 19.25785534,
       36.33715615, 91.12339788, 51.20973278, 49.43829522,  6.18578718,
       54.23787257, 27.16931762, 56.59640609, 58.54542001, 32.2125467 ,
       95.71358094, 80.24513781, 80.79169759, 87.35174307, 75.95596124,
       36.2438496 ,  1.76633103, 85.63884908, 45.52324172, 75.17254169,
       84.5376927 , 64.79702126, 47.55399397, 51.95492873, 45.74817436,
        4.71088697, 34.97783985, 97.88697477, 50.68368995, 79.93638438,
       90.72021559, 50.19762054, 81.99926174, 58.50028407, 90.62747984,
       14.05649843, 16.1233468 , 75.23054736, 42.36397666, 31.82756077,
       69.48819092, 19.51359091, 65.15156288,  2.20837087,  2.20717215,
        1.83468519,  1.87143497, 56.04630184, 95.35283   , 86.59162171,
       27.31108765, 67.41592342,  4.30462044, 48.1655147 , 24.81773828,
       83.89685295, 10.65562686, 49.16033341, 99.86027098, 48.10184304,
       28.10541391,  1.05270928, 84.02138575, 35.23236515, 40.31294805,
       43.25953496, 55.04969156, 49.76164072, 35.50235686, 48.95317082,
       12.10972906, 65.05659781, 86.73979986, 87.14317756, 16.09754615,
       35.146015  , 54.80537646, 60.04052325, 67.18084625, 66.90505721,
       85.32753205, 26.30220462,  4.28532852,  7.57223136, 29.67218263,
        6.058429  , 24.67482093, 31.20109583, 23.10172397, 82.23877607,
       16.4108393 , 62.24566348, 38.95676051, 19.40011509, 67.32564169,
        6.91930773, 68.65807038, 62.56704546, 95.75023825, 86.74654614,
       62.52105331,  5.23559544, 87.50156109, 56.76793988,  9.65707977,
       10.55446795, 86.47630655, 28.40461649, 58.774356  , 34.21956217,
       83.05400452, 64.0429231 , 10.40113295, 93.28191221, 84.92235632,
       87.57186627, 88.96564775, 50.49118784, 27.82428845, 23.25102457,
       72.0555844 , 29.32378746, 97.41900884, 54.53836214,  1.55299003,
       33.88668247, 56.97976516,  9.15685389, 41.69136651,  9.72611118,
       74.38257774, 60.93993772, 74.5731149 , 51.35042997, 58.92604701,
       59.47143793, 38.10235321, 99.91044438, 96.29711397, 28.05889168,
       11.06683914, 81.04224462, 68.42566359, 76.70026135, 59.51451607,
       61.45681056, 15.14434017, 76.53633081, 17.29185154,  5.61433491,
       37.62917095, 74.38349332, 25.78202594, 63.75333837, 96.5538648 ,
       49.3021257 , 58.78136051, 79.01596764, 82.58871482, 14.98812647,
       91.68651803, 25.59947036, 72.33432243, 97.62416343, 81.24847132,
        6.49824832, 86.55510055, 21.78094143, 76.98463865,  6.23160412,
        8.50822514, 18.6102772 ,  6.01808152, 52.56674758, 43.85939415,
       72.83157607, 68.71962914,  9.55915213, 28.53086671, 46.23415965,
       24.44596615,  8.11033383, 58.04452388, 52.19514915,  8.17661115,
       97.45844952, 47.82138292, 34.74352269, 47.78653898, 93.88171714,
       17.95171347, 12.85837419, 23.41611684, 40.05639034, 68.69963686,
       77.84793875, 24.71046686, 79.68773592, 65.38755561, 22.64658788,
       11.59055111, 60.74510296, 97.45593922, 31.65793169, 40.51158057,
       86.04776533, 63.34341783, 35.36467848, 60.50584303, 39.71644256,
       73.306986  , 75.08447019, 37.39034021, 78.94325648, 89.34213368,
       53.53060272, 10.93278289, 16.1722974 , 70.04769269, 29.38362735,
        9.05082248, 43.64239176, 82.51904905, 41.60781984, 89.46689084,
       75.79229924, 13.1283029 , 56.92721332, 60.75715612,  2.97462138,
       19.97349736, 46.82952568, 47.91754507,  9.329007  , 52.24896089,
       47.50080243, 54.49967972, 51.1564569 , 35.93132001, 90.76383621,
       54.33871367, 55.51037797, 66.71756384, 64.03652692, 99.19539795,
       15.57494734, 30.22963831, 42.99093652, 80.77531009,  1.70584869,
       34.46888219, 58.7210004 , 60.38885926, 68.00964849, 88.82922186,
        2.02450622, 66.6188186 , 61.77975268, 83.02080752, 22.32463257,
       35.53758872, 26.96204968, 42.95626259, 37.43648103, 57.80799784,
       99.8331706 , 20.79741003, 60.99874811, 83.58296594, 59.44715761,
       17.42070451, 26.82861904, 89.37365421,  6.60931122, 25.24287389,
       44.76534476, 58.25629807, 36.912535  , 51.07420174, 64.73809201,
       13.22131344, 76.73108382, 99.21084814, 78.2803435 , 76.5665262 ,
       59.56902558, 43.74935175, 60.80669687, 33.01778813, 90.26263592,
       39.98674007, 88.14490777, 45.3520421 , 94.9835265 , 86.18630953,
       55.26261024, 46.74603782,  7.17062952, 86.36655516, 29.14228401,
       90.8236136 , 84.81098469, 90.47520659, 60.80349246, 21.4319084 ,
       71.5851168 , 94.05103896, 93.73677915, 19.01708806, 75.88292311,
       65.85730446,  8.41694185, 71.0640653 , 13.79159544, 54.1550727 ,
       54.33608759, 49.5454867 , 66.98949564, 63.70463792, 64.82685946,
       24.3935862 , 74.40804947, 82.09814898, 33.92499214, 85.92978976,
        2.55936351, 50.60789751, 98.99059032, 64.1636412 , 11.10745929,
       68.76455674, 30.55496875, 85.58730268, 50.67305828, 90.45991626,
        4.14352777, 48.4416179 , 12.84603572, 11.83330974, 44.48757549,
       83.67297429, 99.02950529, 85.93638836,  5.2730482 , 17.05384076,
       79.41198912, 82.0163349 , 30.28918704, 79.39815183, 88.30078729,
       17.31031647, 67.9133331 , 39.47788009, 79.69753037, 88.22209449,
        4.44739906, 14.87767488, 45.58269749, 23.87829451, 60.86224463,
       65.48143008,  2.4695291 , 81.88224605, 25.96170855, 26.98960473,
       23.88252175, 70.91139555, 89.74979371,  9.0304814 , 51.31397601,
       73.06319621, 60.60883149, 98.79355842, 22.7770589 , 24.17686974,
       79.07854774, 15.56358844, 43.12431503,  9.07034106, 25.15523769,
        5.20781391, 96.52795303, 44.31691044, 87.53998732, 72.19224624,
       60.21485204, 56.70768016,  7.89607441, 20.74668878, 65.33924281,
       17.32061716, 17.87614316, 91.76043278, 16.88274352, 30.17643094,
       22.66754634, 71.80451316, 33.42445268, 66.77302743, 38.76358128,
       10.67589104,  7.10275969, 83.67169861, 78.04160128, 95.08463841,
       21.72258221, 22.73171273,  1.75501049,  3.17090179, 82.64247519,
       18.7906917 , 15.15923659, 34.36925942, 84.56274271, 21.01919811,
        8.0421482 , 59.56961432, 45.1829214 , 81.30354442, 89.23971366,
        7.85715801, 17.02229743, 15.70962611, 37.21740178, 27.64994034,
       28.96779175, 13.39648297, 87.93276373, 15.70433862, 14.41438018,
       80.17085894, 15.47227011, 82.34706124, 89.28476749, 30.81458881,
       13.71848488, 44.54639   , 90.28696841,  9.04640097, 36.34798614,
       71.50604455, 83.51633065,  7.56962935,  6.92377479, 39.14260089,
       29.87159839, 47.9987629 , 30.60101326, 42.44593175, 59.19400089,
       47.09585662, 12.54505451, 87.84242769, 25.02120996, 57.2696534 ,
       74.80381551, 46.23794506, 78.37122589, 57.62096023, 61.38375905,
       22.25506505, 71.66068134, 54.13112521, 65.9572322 , 60.75024351,
       44.72517134, 20.04020741, 73.60096368, 71.12474161, 61.49982349,
       81.63121362, 33.83168231,  9.07198802, 63.45821418, 38.15105343,
       53.78375948, 55.96254365,  7.34261218, 98.77254919,  7.98104225,
       15.83543315, 78.24807743, 43.21202194, 68.48143323, 80.58950478,
       86.52755281, 48.67386813, 75.10537602,  4.44137509, 43.73218359,
       94.57197576,  9.37335713, 69.91894884, 73.28913179, 25.19697932,
       56.64001066, 42.56495851, 41.91578339, 26.65413187, 82.37446527,
       87.5783107 , 66.45912161, 66.03062788, 42.30993621, 73.1289815 ,
       20.67382759, 74.46000604, 90.51298485,  5.05456565, 55.02071877,
       19.18209955, 85.86850709, 13.8476266 , 58.24411504,  5.84166552,
       40.62283546, 29.95200962, 11.55673434, 29.07068442, 90.32833038,
       28.3267849 , 83.00461564, 44.72558298, 21.81100035,  2.85141826,
       96.07534591, 93.13825162, 33.48309856, 41.07976903, 86.80447164,
       73.69512878, 78.11452392, 14.57691869, 23.42279918, 71.77892995,
       46.37158518, 36.98326588, 45.3143174 , 31.61972518, 84.43717961,
       57.68286285, 16.64668009, 50.83848248, 80.26770819,  8.81457948,
        1.00772739, 91.28901034, 13.28087101, 86.58280328, 39.94558033,
       55.54195621, 30.1147372 , 92.70606948, 48.91450949, 61.22876671,
       85.50911069, 72.6652839 ,  6.87023805, 38.01630207, 25.5381843 ,
        7.68815699, 18.15740269, 80.94469947, 25.42435774, 67.52940394,
       46.51430076, 79.3869347 , 15.07793858, 54.80652289, 41.01089576,
       72.4117853 , 50.57389711, 72.97021372, 29.70280701,  6.84438125,
       54.06506782, 85.65949519, 38.68549136, 60.52623946, 56.50387651,
       60.34656888, 48.94673585, 73.0383074 , 48.32195644, 23.73541107,
       76.21982637, 96.67718969, 71.53109475, 90.8527142 , 27.35388756,
        6.01413239, 25.59982091, 76.71609243, 64.12406805, 57.9339618 ,
       98.37441029, 17.8596873 , 44.13756762, 46.85823328, 34.96056526,
       45.24664178, 32.71383135, 44.8665193 , 72.3479181 , 78.0231589 ,
       21.19823795, 59.81218959, 65.44295352, 11.88634313,  6.31912588,
       17.05044945, 79.63472641, 81.6519129 , 98.5709915 , 96.27918477,
       34.32371096, 63.60374628, 89.97483037, 89.19719315, 63.06400576,
       76.86643216, 74.05541881, 98.3372384 , 65.56825398, 73.84180182,
       25.31026221, 53.00393754, 85.45153732, 34.81775804,  2.22582419,
       12.08106276, 82.22279637, 89.97227015, 80.63702459, 69.43157802,
       65.66645773, 43.99149336, 32.59736706, 38.44650962, 71.14176533,
       20.92421464, 43.93234862, 49.17442235, 49.20593938, 35.03977558,
       29.69356913, 79.40528605, 38.91026343, 57.92572674, 80.56581889,
       99.99221222,  5.52888213, 50.61808381, 46.28619152, 51.93563825,
        9.04187388,  9.89207646, 30.82578204, 52.80315012, 27.15936354,
       62.0535066 ,  3.50306466, 31.29571274, 17.48107661, 39.08564426,
       96.78570356,  9.8907622 , 40.17965319, 60.49023299, 17.97031628,
       79.73003981, 68.68744595, 62.31863288, 58.61169762, 70.99697387,
       79.55355814, 76.37341186, 99.06170696, 29.22305768, 45.57789075,
       67.53335308, 64.70459854, 40.24150264, 82.92981208,  3.85840622,
       64.10492931, 85.90715357, 12.21096558, 94.00774963, 83.88935605,
       68.8199518 , 18.11933768,  3.85912252, 16.45129575, 17.0196407 ,
       14.71996696, 36.5245811 , 17.50521948, 47.11862709, 87.49259763,
       35.26819567, 12.54210668, 76.35122987, 27.61216363, 23.3293844 ,
       61.26888293, 83.95193738, 86.95493412, 65.16185283, 26.62321536,
        7.19975841, 97.4226911 , 61.243559  , 40.06514677, 33.90077977,
       20.30635471, 83.44374208, 47.44278963,  3.38563567, 78.3822293 ,
       48.58845963, 15.74113506, 31.21643637, 25.50807758, 48.23010304])

In [20]:
series1 = pd.Series(score1, index = np.arange(0, 1000))
series2 = pd.Series(score2, index = np.arange(0, 1000))

series1

df_ujian = df_ujian.assign(score1 = series1, score2 = series2)
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,95,4.518598,29.494220
1,female,group C,some college,standard,completed,69,90,88,73,75.226633,91.346899
2,female,group B,master's degree,standard,none,90,95,93,77,23.582050,65.949444
3,male,group A,associate's degree,free/reduced,none,47,57,44,75,17.228560,2.014894
4,male,group C,some college,standard,none,76,78,75,89,94.463825,21.098763
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,63,48.588460,14.558733
996,male,group C,high school,free/reduced,none,62,55,55,63,15.741135,49.002925
997,female,group C,high school,free/reduced,completed,59,71,65,62,31.216436,29.488807
998,female,group D,some college,standard,completed,68,78,77,75,25.508078,81.764293
999,female,group D,some college,free/reduced,none,77,86,86,84,48.230103,33.728099

In [21]:
#df_ujian.insert(1,'test 3', series1)
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,95,4.518598,29.494220
1,female,group C,some college,standard,completed,69,90,88,73,75.226633,91.346899
2,female,group B,master's degree,standard,none,90,95,93,77,23.582050,65.949444
3,male,group A,associate's degree,free/reduced,none,47,57,44,75,17.228560,2.014894
4,male,group C,some college,standard,none,76,78,75,89,94.463825,21.098763
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,63,48.588460,14.558733
996,male,group C,high school,free/reduced,none,62,55,55,63,15.741135,49.002925
997,female,group C,high school,free/reduced,completed,59,71,65,62,31.216436,29.488807
998,female,group D,some college,standard,completed,68,78,77,75,25.508078,81.764293
999,female,group D,some college,free/reduced,none,77,86,86,84,48.230103,33.728099

In [22]:
print (df_ujian['math score'].sum())
print (df_ujian['math score'].count())
print (df_ujian['math score'].mean())
print (df_ujian['math score'].std())
print (df_ujian['math score'].max())
print (df_ujian['math score'].min())
df_ujian.describe()

66089
1000
66.089
15.163080096009468
100
0

,math score,reading score,writing score,language score,score1,score2
count,1000.00000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,66.08900,69.169000,68.054000,79.826000,50.719429,49.772196
std,15.16308,14.600192,15.195657,11.477781,28.402457,28.692584
min,0.00000,17.000000,10.000000,60.000000,1.007727,1.019253
25%,57.00000,59.000000,57.750000,71.000000,25.736475,25.316588
50%,66.00000,70.000000,69.000000,79.000000,51.332203,48.009909
75%,77.00000,79.000000,79.000000,90.000000,75.186064,74.990674
max,100.00000,100.000000,100.000000,99.000000,99.992212,99.974674

In [23]:
df_ujian['rerata'] = (df_ujian['math score'] + df_ujian['reading score'] + df_ujian['writing score']) /3
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2,rerata
0,female,group B,bachelor's degree,standard,none,72,72,74,95,4.518598,29.494220,72.666667
1,female,group C,some college,standard,completed,69,90,88,73,75.226633,91.346899,82.333333
2,female,group B,master's degree,standard,none,90,95,93,77,23.582050,65.949444,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,75,17.228560,2.014894,49.333333
4,male,group C,some college,standard,none,76,78,75,89,94.463825,21.098763,76.333333
...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,63,48.588460,14.558733,94.000000
996,male,group C,high school,free/reduced,none,62,55,55,63,15.741135,49.002925,57.333333
997,female,group C,high school,free/reduced,completed,59,71,65,62,31.216436,29.488807,65.000000
998,female,group D,some college,standard,completed,68,78,77,75,25.508078,81.764293,74.333333
999,female,group D,some college,free/reduced,none,77,86,86,84,48.230103,33.728099,83.000000

In [24]:
# untuk menghitung nilai
df_ujian['math score'].value_counts()

math score
65    36
62    35
69    32
59    32
61    27
      ..
24     1
28     1
33     1
18     1
8      1
Name: count, Length: 81, dtype: int64

In [25]:
# untuk menghitung nilai 
df_ujian['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [26]:
# untuk menghitung nilai dengan tanpilan ternormalisasi
df_ujian['race/ethnicity'].value_counts(normalize=True)

race/ethnicity
group C    0.319
group D    0.262
group B    0.190
group E    0.140
group A    0.089
Name: proportion, dtype: float64

In [27]:
# pembuatan 2 digit
df_ujian['race/ethnicity'].value_counts(normalize=True).round(2)

race/ethnicity
group C    0.32
group D    0.26
group B    0.19
group E    0.14
group A    0.09
Name: proportion, dtype: float64

In [28]:
# urut berdasarkan 1 kolom
df_ujian.sort_values('math score')
# urutan terbalik atau tidak
df_ujian.sort_values('math score', ascending=False)
# urutan berdasarkan 2 kolom atau ascending berarti
df_ujian.sort_values(['math score','reading score'],ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2,rerata
149,male,group E,associate's degree,free/reduced,completed,100,100,93,82,74.907613,84.252738,97.666667
458,female,group E,bachelor's degree,standard,none,100,100,100,70,52.195149,30.254682,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,87,43.932349,95.103684,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,65,12.210966,93.113443,100.000000
625,male,group D,some college,standard,completed,100,97,99,69,17.310316,25.751311,98.666667
...,...,...,...,...,...,...,...,...,...,...,...,...
145,female,group C,some college,free/reduced,none,22,39,33,92,26.717785,4.464714,31.333333
787,female,group B,some college,standard,none,19,38,32,82,13.847627,93.957990,29.666667
17,female,group B,some high school,free/reduced,none,18,32,28,61,70.220601,36.515674,26.000000
980,female,group B,high school,free/reduced,none,8,24,23,98,61.268883,77.645154,18.333333
59,female,group C,some high school,free/reduced,none,0,17,10,92,7.028030,69.212177,9.000000

In [29]:
import random
new_index = np.arange (0, 1000)
random.shuffle(new_index)# mengacak urutan
df_ujian ['new_index'] = new_index # untuk menambah kolom 
df_ujian.set_index('new_index', inplace=True) # untuk membuat new index sebagai index baru
df_ujian
df_ujian.sort_index()
df_ujian.sort_index(ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score,score1,score2,rerata
new_index,,,,,,,,,,,,
999,female,group D,some high school,standard,none,48,58,54,94,48.673868,57.796595,53.333333
998,female,group D,some high school,standard,none,68,71,75,93,73.289132,95.794650,71.333333
997,female,group B,bachelor's degree,standard,none,75,84,80,82,17.019641,45.192541,79.666667
996,female,group B,bachelor's degree,standard,none,52,65,69,64,35.146015,37.139429,62.000000
995,male,group C,associate's degree,standard,completed,87,100,95,87,86.476307,6.409570,94.000000
...,...,...,...,...,...,...,...,...,...,...,...,...
4,male,group C,associate's degree,free/reduced,none,64,66,59,97,49.302126,69.988592,63.000000
3,female,group E,bachelor's degree,standard,completed,71,70,70,96,59.812190,92.261528,70.333333
2,male,group C,high school,standard,completed,58,52,54,82,29.223058,28.963272,54.666667
1,female,group C,associate's degree,standard,none,52,55,57,94,2.851418,61.245332,54.666667
0,female,group B,high school,free/reduced,completed,67,80,81,87,2.469529,68.630130,76.000000

In [30]:
df_ujian.rename(columns={
    'math score' :'MS',
    'reading score' : 'RS',
    'writing score ': 'WS'                    }
, inplace=True)
df_ujian

,gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,writing score,language score,score1,score2,rerata
new_index,,,,,,,,,,,,
180,female,group B,bachelor's degree,standard,none,72,72,74,95,4.518598,29.494220,72.666667
821,female,group C,some college,standard,completed,69,90,88,73,75.226633,91.346899,82.333333
950,female,group B,master's degree,standard,none,90,95,93,77,23.582050,65.949444,92.666667
346,male,group A,associate's degree,free/reduced,none,47,57,44,75,17.228560,2.014894,49.333333
671,male,group C,some college,standard,none,76,78,75,89,94.463825,21.098763,76.333333
...,...,...,...,...,...,...,...,...,...,...,...,...
289,female,group E,master's degree,standard,completed,88,99,95,63,48.588460,14.558733,94.000000
435,male,group C,high school,free/reduced,none,62,55,55,63,15.741135,49.002925,57.333333
752,female,group C,high school,free/reduced,completed,59,71,65,62,31.216436,29.488807,65.000000
116,female,group D,some college,standard,completed,68,78,77,75,25.508078,81.764293,74.333333
237,female,group D,some college,free/reduced,none,77,86,86,84,48.230103,33.728099,83.000000